Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SWA
SWA(config)#int range g0/0- 1
SWA(config-if-range)#channel-group 1 mode on
Creating a port-channel interface Port-channel 1

SWA(config-if-range)#
*Jun 26 09:28:29.354: %LINEPROTO-5-UPDOWN: Line protocol on Interface Port-channel1, changed state to up
SWA(config-if-range)#int range g0/2- 3
SWA(config-if-range)#channel-group 2 mode auto
*Jun 26 09:29:42.400: %PM-4-ERR_DISABLE: channel-misconfig (STP) error detected on Po1, putting Gi0/0 in err-disable state
*Jun 26 09:29:42.406: %PM-4-ERR_DISABLE: channel-misconfig (STP) error detected on Po1, putting Gi0/1 in err-disable state
*Jun 26 09:29:42.413: %PM-4-ERR_DISABLE: channel-misconfig (STP) error detected on Po1, putting Po1 in err-disable state
*Jun 26 09:29:43.404: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to down
*Jun 26 09:29:43.407: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down
*Jun 26 09:29:44.405: %LINK-3-UPDOWN: Interface GigabitEthernet0/0, changed state to down
*Jun 26 09:29:44.415: %LINK-3-UPDOWN: Interface Port-channel1, changed state to down
*Jun 26 09:29:44.419: %LINK-3-UPDOWN: Interface GigabitEthernet0/1, changed state to down
*Jun 26 09:29:45.415: %LINEPROTO-5-UPDOWN: Line protocol on Interface Port-channel1, changed state to down
Creating a port-channel interface Port-channel 2

SWA(config-if-range)#int range g1/0- 1
SWA(config-if-range)#channel-group 3 mode active
Creating a port-channel interface Port-channel 3

SWA(config-if-range)#
SWA(config-if-range)#
*Jun 26 09:32:56.110: %EC-5-L3DONTBNDL2: Gi1/1 suspended: LACP currently not enabled on the remote port.
*Jun 26 09:32:56.145: %EC-5-L3DONTBNDL2: Gi1/0 suspended: LACP currently not enabled on the remote port.

